HelTecAutomation/CubeCell-Arduino/boards.txt
CubeCell-Capsule.menu.LORAWAN_NETMODE.0=OTAA
CubeCell-Capsule.menu.LORAWAN_NETMODE.0.build.LORAWAN_NETMODE=true
CubeCell-Capsule.menu.LORAWAN_NETMODE.1=ABP
CubeCell-Capsule.menu.LORAWAN_NETMODE.1.build.LORAWAN_NETMODE=false

CubeCell-Capsule.menu.LORAWAN_ADR.0=ON
CubeCell-Capsule.menu.LORAWAN_ADR.0.build.LORAWAN_ADR=true
CubeCell-Capsule.menu.LORAWAN_ADR.1=OFF
CubeCell-Capsule.menu.LORAWAN_ADR.1.build.LORAWAN_ADR=false

CubeCell-Capsule.menu.LORAWAN_UPLINKMODE.0=CONFIRMED
CubeCell-Capsule.menu.LORAWAN_UPLINKMODE.0.build.LORAWAN_UPLINKMODE=true
CubeCell-Capsule.menu.LORAWAN_UPLINKMODE.1=UNCONFIRMED
CubeCell-Capsule.menu.LORAWAN_UPLINKMODE.1.build.LORAWAN_UPLINKMODE=false

CubeCell-Capsule.menu.LORAWAN_Net_Reserve.0=OFF
CubeCell-Capsule.menu.LORAWAN_Net_Reserve.0.build.LORAWAN_Net_Reserve=false
CubeCell-Capsule.menu.LORAWAN_Net_Reserve.1=ON
CubeCell-Capsule.menu.LORAWAN_Net_Reserve.1.build.LORAWAN_Net_Reserve=true

CubeCell-Capsule.menu.LORAWAN_AT_SUPPORT.0=ON
CubeCell-Capsule.menu.LORAWAN_AT_SUPPORT.0.build.LORAWAN_AT_SUPPORT=1
CubeCell-Capsule.menu.LORAWAN_AT_SUPPORT.1=OFF
CubeCell-Capsule.menu.LORAWAN_AT_SUPPORT.1.build.LORAWAN_AT_SUPPORT=0

CubeCell-Capsule.menu.LORAWAN_RGB.1=ACTIVE
CubeCell-Capsule.menu.LORAWAN_RGB.1.build.RGB=1
CubeCell-Capsule.menu.LORAWAN_RGB.0=DEACTIVE
CubeCell-Capsule.menu.LORAWAN_RGB.0.build.RGB=0


CubeCell-Capsule.menu.LORAWAN_DebugLevel.0=None
CubeCell-Capsule.menu.LORAWAN_DebugLevel.0.build.LORAWAN_DebugLevel=0
CubeCell-Capsule.menu.LORAWAN_DebugLevel.1=Freq
CubeCell-Capsule.menu.LORAWAN_DebugLevel.1.build.LORAWAN_DebugLevel=1
CubeCell-Capsule.menu.LORAWAN_DebugLevel.2=Freq && DIO
CubeCell-Capsule.menu.LORAWAN_DebugLevel.2.build.LORAWAN_DebugLevel=2
##############################################################

CubeCell-Module.name=CubeCell-Module（HTCC-AM01）

CubeCell-Module.upload.tool=CubeCellflash
CubeCell-Module.upload.maximum_size=131072
CubeCell-Module.upload.maximum_data_size=131072
CubeCell-Module.upload.wait_for_upload_port=true

CubeCell-Module.build.board=CubeCell_Module
CubeCell-Module.build.core=asr650x
CubeCell-Module.build.mcu=ASR6501
CubeCell-Module.build.f_cpu=48000000L
CubeCell-Module.build.variant=CubeCell-Module

CubeCell-Module.menu.LORAWAN_REGION.0=REGION_AS923(AS1)
CubeCell-Module.menu.LORAWAN_REGION.0.build.band=REGION_AS923_AS1
CubeCell-Module.menu.LORAWAN_REGION.1=REGION_AS923(AS2)
CubeCell-Module.menu.LORAWAN_REGION.1.build.band=REGION_AS923_AS2
CubeCell-Module.menu.LORAWAN_REGION.2=REGION_AU915
CubeCell-Module.menu.LORAWAN_REGION.2.build.band=REGION_AU915
CubeCell-Module.menu.LORAWAN_REGION.3=REGION_CN470
CubeCell-Module.menu.LORAWAN_REGION.3.build.band=REGION_CN470
CubeCell-Module.menu.LORAWAN_REGION.4=REGION_CN779
CubeCell-Module.menu.LORAWAN_REGION.4.build.band=REGION_CN779
CubeCell-Module.menu.LORAWAN_REGION.5=REGION_EU433
CubeCell-Module.menu.LORAWAN_REGION.5.build.band=REGION_EU433
CubeCell-Module.menu.LORAWAN_REGION.6=REGION_EU868
CubeCell-Module.menu.LORAWAN_REGION.6.build.band=REGION_EU868
CubeCell-Module.menu.LORAWAN_REGION.7=REGION_KR920
CubeCell-Module.menu.LORAWAN_REGION.7.build.band=REGION_KR920
CubeCell-Module.menu.LORAWAN_REGION.8=REGION_IN865
CubeCell-Module.menu.LORAWAN_REGION.8.build.band=REGION_IN865
CubeCell-Module.menu.LORAWAN_REGION.9=REGION_US915
CubeCell-Module.menu.LORAWAN_REGION.9.build.band=REGION_US915
CubeCell-Module.menu.LORAWAN_REGION.10=REGION_US915_HYBRID
CubeCell-Module.menu.LORAWAN_REGION.10.build.band=REGION_US915_HYBRID

CubeCell-Module.menu.LORAWAN_CLASS.0=CLASS_A
CubeCell-Module.menu.LORAWAN_CLASS.0.build.LORAWAN_CLASS=CLASS_A
##CubeCell-Capsule.menu.LORAWAN_CLASS.1=CLASS_B
##CubeCell-Capsule.menu.LORAWAN_CLASS.1.build.LORAWAN_CLASS=CLASS_B
CubeCell-Module.menu.LORAWAN_CLASS.2=CLASS_C
CubeCell-Module.menu.LORAWAN_CLASS.2.build.LORAWAN_CLASS=CLASS_C

CubeCell-Module.menu.LORAWAN_DEVEUI.0=CUSTOM
CubeCell-Module.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
CubeCell-Module.menu.LORAWAN_DEVEUI.1=Generate By ChipID
CubeCell-Module.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

CubeCell-Module.menu.LORAWAN_NETMODE.0=OTAA
CubeCell-Module.menu.LORAWAN_NETMODE.0.build.LORAWAN_NETMODE=true
CubeCell-Module.menu.LORAWAN_NETMODE.1=ABP
CubeCell-Module.menu.LORAWAN_NETMODE.1.build.LORAWAN_NETMODE=false

CubeCell-Module.menu.LORAWAN_ADR.0=ON
CubeCell-Module.menu.LORAWAN_ADR.0.build.LORAWAN_ADR=true
CubeCell-Module.menu.LORAWAN_ADR.1=OFF
CubeCell-Module.menu.LORAWAN_ADR.1.build.LORAWAN_ADR=false

CubeCell-Module.menu.LORAWAN_UPLINKMODE.0=CONFIRMED
CubeCell-Module.menu.LORAWAN_UPLINKMODE.0.build.LORAWAN_UPLINKMODE=true
CubeCell-Module.menu.LORAWAN_UPLINKMODE.1=UNCONFIRMED
CubeCell-Module.menu.LORAWAN_UPLINKMODE.1.build.LORAWAN_UPLINKMODE=false

CubeCell-Module.menu.LORAWAN_Net_Reserve.0=OFF
CubeCell-Module.menu.LORAWAN_Net_Reserve.0.build.LORAWAN_Net_Reserve=false
CubeCell-Module.menu.LORAWAN_Net_Reserve.1=ON
CubeCell-Module.menu.LORAWAN_Net_Reserve.1.build.LORAWAN_Net_Reserve=true

CubeCell-Module.menu.LORAWAN_AT_SUPPORT.0=ON
CubeCell-Module.menu.LORAWAN_AT_SUPPORT.0.build.LORAWAN_AT_SUPPORT=1
CubeCell-Module.menu.LORAWAN_AT_SUPPORT.1=OFF
CubeCell-Module.menu.LORAWAN_AT_SUPPORT.1.build.LORAWAN_AT_SUPPORT=0

CubeCell-Module.menu.LORAWAN_RGB.0=DEACTIVE
CubeCell-Module.menu.LORAWAN_RGB.0.build.RGB=0

CubeCell-Module.menu.LORAWAN_DebugLevel.0=None
CubeCell-Module.menu.LORAWAN_DebugLevel.0.build.LORAWAN_DebugLevel=0
CubeCell-Module.menu.LORAWAN_DebugLevel.1=Freq
CubeCell-Module.menu.LORAWAN_DebugLevel.1.build.LORAWAN_DebugLevel=1
CubeCell-Module.menu.LORAWAN_DebugLevel.2=Freq && DIO
CubeCell-Module.menu.LORAWAN_DebugLevel.2.build.LORAWAN_DebugLevel=2

###############################

CubeCell-BoardPlus.name=CubeCell-Board Plus（HTCC-AB02）

CubeCell-BoardPlus.upload.tool=CubeCellflash
CubeCell-BoardPlus.upload.maximum_size=131072
CubeCell-BoardPlus.upload.maximum_data_size=131072
CubeCell-BoardPlus.upload.wait_for_upload_port=true

CubeCell-BoardPlus.build.board=CubeCell_BoardPlus
CubeCell-BoardPlus.build.core=asr650x
CubeCell-BoardPlus.build.mcu=ASR6502
CubeCell-BoardPlus.build.f_cpu=48000000L
CubeCell-BoardPlus.build.variant=CubeCell-BoardPlus

