HelTecAutomation/CubeCell-Arduino/boards.txt
CubeCell-BoardPlus.menu.LORAWAN_REGION.0=REGION_AS923(AS1)
CubeCell-BoardPlus.menu.LORAWAN_REGION.0.build.band=REGION_AS923_AS1
CubeCell-BoardPlus.menu.LORAWAN_REGION.1=REGION_AS923(AS2)
CubeCell-BoardPlus.menu.LORAWAN_REGION.1.build.band=REGION_AS923_AS2
CubeCell-BoardPlus.menu.LORAWAN_REGION.2=REGION_AU915
CubeCell-BoardPlus.menu.LORAWAN_REGION.2.build.band=REGION_AU915
CubeCell-BoardPlus.menu.LORAWAN_REGION.3=REGION_CN470
CubeCell-BoardPlus.menu.LORAWAN_REGION.3.build.band=REGION_CN470
CubeCell-BoardPlus.menu.LORAWAN_REGION.4=REGION_CN779
CubeCell-BoardPlus.menu.LORAWAN_REGION.4.build.band=REGION_CN779
CubeCell-BoardPlus.menu.LORAWAN_REGION.5=REGION_EU433
CubeCell-BoardPlus.menu.LORAWAN_REGION.5.build.band=REGION_EU433
CubeCell-BoardPlus.menu.LORAWAN_REGION.6=REGION_EU868
CubeCell-BoardPlus.menu.LORAWAN_REGION.6.build.band=REGION_EU868
CubeCell-BoardPlus.menu.LORAWAN_REGION.7=REGION_KR920
CubeCell-BoardPlus.menu.LORAWAN_REGION.7.build.band=REGION_KR920
CubeCell-BoardPlus.menu.LORAWAN_REGION.8=REGION_IN865
CubeCell-BoardPlus.menu.LORAWAN_REGION.8.build.band=REGION_IN865
CubeCell-BoardPlus.menu.LORAWAN_REGION.9=REGION_US915
CubeCell-BoardPlus.menu.LORAWAN_REGION.9.build.band=REGION_US915
CubeCell-BoardPlus.menu.LORAWAN_REGION.10=REGION_US915_HYBRID
CubeCell-BoardPlus.menu.LORAWAN_REGION.10.build.band=REGION_US915_HYBRID

CubeCell-BoardPlus.menu.LORAWAN_CLASS.0=CLASS_A
CubeCell-BoardPlus.menu.LORAWAN_CLASS.0.build.LORAWAN_CLASS=CLASS_A
##CubeCell-BoardPlus.menu.LORAWAN_CLASS.1=CLASS_B
##CubeCell-BoardPlus.menu.LORAWAN_CLASS.1.build.LORAWAN_CLASS=CLASS_B
CubeCell-BoardPlus.menu.LORAWAN_CLASS.2=CLASS_C
CubeCell-BoardPlus.menu.LORAWAN_CLASS.2.build.LORAWAN_CLASS=CLASS_C

CubeCell-BoardPlus.menu.LORAWAN_DEVEUI.0=CUSTOM
CubeCell-BoardPlus.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
CubeCell-BoardPlus.menu.LORAWAN_DEVEUI.1=Generate By ChipID
CubeCell-BoardPlus.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

CubeCell-BoardPlus.menu.LORAWAN_NETMODE.0=OTAA
CubeCell-BoardPlus.menu.LORAWAN_NETMODE.0.build.LORAWAN_NETMODE=true
CubeCell-BoardPlus.menu.LORAWAN_NETMODE.1=ABP
CubeCell-BoardPlus.menu.LORAWAN_NETMODE.1.build.LORAWAN_NETMODE=false

CubeCell-BoardPlus.menu.LORAWAN_ADR.0=ON
CubeCell-BoardPlus.menu.LORAWAN_ADR.0.build.LORAWAN_ADR=true
CubeCell-BoardPlus.menu.LORAWAN_ADR.1=OFF
CubeCell-BoardPlus.menu.LORAWAN_ADR.1.build.LORAWAN_ADR=false

CubeCell-BoardPlus.menu.LORAWAN_UPLINKMODE.0=CONFIRMED
CubeCell-BoardPlus.menu.LORAWAN_UPLINKMODE.0.build.LORAWAN_UPLINKMODE=true
CubeCell-BoardPlus.menu.LORAWAN_UPLINKMODE.1=UNCONFIRMED
CubeCell-BoardPlus.menu.LORAWAN_UPLINKMODE.1.build.LORAWAN_UPLINKMODE=false

CubeCell-BoardPlus.menu.LORAWAN_Net_Reserve.0=OFF
CubeCell-BoardPlus.menu.LORAWAN_Net_Reserve.0.build.LORAWAN_Net_Reserve=false
CubeCell-BoardPlus.menu.LORAWAN_Net_Reserve.1=ON
CubeCell-BoardPlus.menu.LORAWAN_Net_Reserve.1.build.LORAWAN_Net_Reserve=true

CubeCell-BoardPlus.menu.LORAWAN_AT_SUPPORT.0=ON
CubeCell-BoardPlus.menu.LORAWAN_AT_SUPPORT.0.build.LORAWAN_AT_SUPPORT=1
CubeCell-BoardPlus.menu.LORAWAN_AT_SUPPORT.1=OFF
CubeCell-BoardPlus.menu.LORAWAN_AT_SUPPORT.1.build.LORAWAN_AT_SUPPORT=0

CubeCell-BoardPlus.menu.LORAWAN_RGB.1=ACTIVE
CubeCell-BoardPlus.menu.LORAWAN_RGB.1.build.RGB=1
CubeCell-BoardPlus.menu.LORAWAN_RGB.0=DEACTIVE
CubeCell-BoardPlus.menu.LORAWAN_RGB.0.build.RGB=0

CubeCell-BoardPlus.menu.LORAWAN_DebugLevel.0=None
CubeCell-BoardPlus.menu.LORAWAN_DebugLevel.0.build.LORAWAN_DebugLevel=0
CubeCell-BoardPlus.menu.LORAWAN_DebugLevel.1=Freq
CubeCell-BoardPlus.menu.LORAWAN_DebugLevel.1.build.LORAWAN_DebugLevel=1
CubeCell-BoardPlus.menu.LORAWAN_DebugLevel.2=Freq && DIO
CubeCell-BoardPlus.menu.LORAWAN_DebugLevel.2.build.LORAWAN_DebugLevel=2
##############################################################

CubeCell-GPS.name=CubeCell-GPS（HTCC-AB02S）

CubeCell-GPS.upload.tool=CubeCellflash
CubeCell-GPS.upload.maximum_size=131072
CubeCell-GPS.upload.maximum_data_size=131072
CubeCell-GPS.upload.wait_for_upload_port=true

CubeCell-GPS.build.board=CubeCell_GPS
CubeCell-GPS.build.core=asr650x
CubeCell-GPS.build.mcu=ASR6502
CubeCell-GPS.build.f_cpu=48000000L
CubeCell-GPS.build.variant=CubeCell-GPS

CubeCell-GPS.menu.LORAWAN_REGION.0=REGION_AS923(AS1)
CubeCell-GPS.menu.LORAWAN_REGION.0.build.band=REGION_AS923_AS1
CubeCell-GPS.menu.LORAWAN_REGION.1=REGION_AS923(AS2)
CubeCell-GPS.menu.LORAWAN_REGION.1.build.band=REGION_AS923_AS2
CubeCell-GPS.menu.LORAWAN_REGION.2=REGION_AU915
CubeCell-GPS.menu.LORAWAN_REGION.2.build.band=REGION_AU915
CubeCell-GPS.menu.LORAWAN_REGION.3=REGION_CN470
CubeCell-GPS.menu.LORAWAN_REGION.3.build.band=REGION_CN470
CubeCell-GPS.menu.LORAWAN_REGION.4=REGION_CN779
CubeCell-GPS.menu.LORAWAN_REGION.4.build.band=REGION_CN779
CubeCell-GPS.menu.LORAWAN_REGION.5=REGION_EU433
CubeCell-GPS.menu.LORAWAN_REGION.5.build.band=REGION_EU433
CubeCell-GPS.menu.LORAWAN_REGION.6=REGION_EU868
CubeCell-GPS.menu.LORAWAN_REGION.6.build.band=REGION_EU868
CubeCell-GPS.menu.LORAWAN_REGION.7=REGION_KR920
CubeCell-GPS.menu.LORAWAN_REGION.7.build.band=REGION_KR920
CubeCell-GPS.menu.LORAWAN_REGION.8=REGION_IN865
CubeCell-GPS.menu.LORAWAN_REGION.8.build.band=REGION_IN865
CubeCell-GPS.menu.LORAWAN_REGION.9=REGION_US915
CubeCell-GPS.menu.LORAWAN_REGION.9.build.band=REGION_US915
CubeCell-GPS.menu.LORAWAN_REGION.10=REGION_US915_HYBRID
CubeCell-GPS.menu.LORAWAN_REGION.10.build.band=REGION_US915_HYBRID

CubeCell-GPS.menu.LORAWAN_CLASS.0=CLASS_A
CubeCell-GPS.menu.LORAWAN_CLASS.0.build.LORAWAN_CLASS=CLASS_A
##CubeCell-GPS.menu.LORAWAN_CLASS.1=CLASS_B
##CubeCell-GPS.menu.LORAWAN_CLASS.1.build.LORAWAN_CLASS=CLASS_B
CubeCell-GPS.menu.LORAWAN_CLASS.2=CLASS_C
CubeCell-GPS.menu.LORAWAN_CLASS.2.build.LORAWAN_CLASS=CLASS_C

CubeCell-GPS.menu.LORAWAN_DEVEUI.0=CUSTOM
CubeCell-GPS.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
CubeCell-GPS.menu.LORAWAN_DEVEUI.1=Generate By ChipID
CubeCell-GPS.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

CubeCell-GPS.menu.LORAWAN_NETMODE.0=OTAA
CubeCell-GPS.menu.LORAWAN_NETMODE.0.build.LORAWAN_NETMODE=true
CubeCell-GPS.menu.LORAWAN_NETMODE.1=ABP
CubeCell-GPS.menu.LORAWAN_NETMODE.1.build.LORAWAN_NETMODE=false

CubeCell-GPS.menu.LORAWAN_ADR.0=ON
CubeCell-GPS.menu.LORAWAN_ADR.0.build.LORAWAN_ADR=true
CubeCell-GPS.menu.LORAWAN_ADR.1=OFF
CubeCell-GPS.menu.LORAWAN_ADR.1.build.LORAWAN_ADR=false

CubeCell-GPS.menu.LORAWAN_UPLINKMODE.0=CONFIRMED
CubeCell-GPS.menu.LORAWAN_UPLINKMODE.0.build.LORAWAN_UPLINKMODE=true
CubeCell-GPS.menu.LORAWAN_UPLINKMODE.1=UNCONFIRMED
CubeCell-GPS.menu.LORAWAN_UPLINKMODE.1.build.LORAWAN_UPLINKMODE=false

CubeCell-GPS.menu.LORAWAN_Net_Reserve.0=OFF
CubeCell-GPS.menu.LORAWAN_Net_Reserve.0.build.LORAWAN_Net_Reserve=false
CubeCell-GPS.menu.LORAWAN_Net_Reserve.1=ON
CubeCell-GPS.menu.LORAWAN_Net_Reserve.1.build.LORAWAN_Net_Reserve=true

CubeCell-GPS.menu.LORAWAN_AT_SUPPORT.0=ON
CubeCell-GPS.menu.LORAWAN_AT_SUPPORT.0.build.LORAWAN_AT_SUPPORT=1
CubeCell-GPS.menu.LORAWAN_AT_SUPPORT.1=OFF
CubeCell-GPS.menu.LORAWAN_AT_SUPPORT.1.build.LORAWAN_AT_SUPPORT=0

CubeCell-GPS.menu.LORAWAN_RGB.1=ACTIVE
CubeCell-GPS.menu.LORAWAN_RGB.1.build.RGB=1
CubeCell-GPS.menu.LORAWAN_RGB.0=DEACTIVE
CubeCell-GPS.menu.LORAWAN_RGB.0.build.RGB=0


CubeCell-GPS.menu.LORAWAN_DebugLevel.0=None
CubeCell-GPS.menu.LORAWAN_DebugLevel.0.build.LORAWAN_DebugLevel=0
CubeCell-GPS.menu.LORAWAN_DebugLevel.1=Freq
CubeCell-GPS.menu.LORAWAN_DebugLevel.1.build.LORAWAN_DebugLevel=1
CubeCell-GPS.menu.LORAWAN_DebugLevel.2=Freq && DIO
CubeCell-GPS.menu.LORAWAN_DebugLevel.2.build.LORAWAN_DebugLevel=2
##############################################################

CubeCell-ModulePlus.name=CubeCell-Module Plus（HTCC-AM02）

CubeCell-ModulePlus.upload.tool=CubeCellflash
CubeCell-ModulePlus.upload.maximum_size=131072
CubeCell-ModulePlus.upload.maximum_data_size=131072
CubeCell-ModulePlus.upload.wait_for_upload_port=true

CubeCell-ModulePlus.build.board=CubeCell_ModulePlus
CubeCell-ModulePlus.build.core=asr650x
CubeCell-ModulePlus.build.mcu=ASR6502
CubeCell-ModulePlus.build.f_cpu=48000000L
CubeCell-ModulePlus.build.variant=CubeCell-ModulePlus

CubeCell-ModulePlus.menu.LORAWAN_REGION.0=REGION_AS923(AS1)
CubeCell-ModulePlus.menu.LORAWAN_REGION.0.build.band=REGION_AS923_AS1
CubeCell-ModulePlus.menu.LORAWAN_REGION.1=REGION_AS923(AS2)
CubeCell-ModulePlus.menu.LORAWAN_REGION.1.build.band=REGION_AS923_AS2
CubeCell-ModulePlus.menu.LORAWAN_REGION.2=REGION_AU915
CubeCell-ModulePlus.menu.LORAWAN_REGION.2.build.band=REGION_AU915
CubeCell-ModulePlus.menu.LORAWAN_REGION.3=REGION_CN470
CubeCell-ModulePlus.menu.LORAWAN_REGION.3.build.band=REGION_CN470
CubeCell-ModulePlus.menu.LORAWAN_REGION.4=REGION_CN779
CubeCell-ModulePlus.menu.LORAWAN_REGION.4.build.band=REGION_CN779
CubeCell-ModulePlus.menu.LORAWAN_REGION.5=REGION_EU433
CubeCell-ModulePlus.menu.LORAWAN_REGION.5.build.band=REGION_EU433
CubeCell-ModulePlus.menu.LORAWAN_REGION.6=REGION_EU868
CubeCell-ModulePlus.menu.LORAWAN_REGION.6.build.band=REGION_EU868
CubeCell-ModulePlus.menu.LORAWAN_REGION.7=REGION_KR920
CubeCell-ModulePlus.menu.LORAWAN_REGION.7.build.band=REGION_KR920
CubeCell-ModulePlus.menu.LORAWAN_REGION.8=REGION_IN865
CubeCell-ModulePlus.menu.LORAWAN_REGION.8.build.band=REGION_IN865
CubeCell-ModulePlus.menu.LORAWAN_REGION.9=REGION_US915
CubeCell-ModulePlus.menu.LORAWAN_REGION.9.build.band=REGION_US915
CubeCell-ModulePlus.menu.LORAWAN_REGION.10=REGION_US915_HYBRID
CubeCell-ModulePlus.menu.LORAWAN_REGION.10.build.band=REGION_US915_HYBRID

CubeCell-ModulePlus.menu.LORAWAN_CLASS.0=CLASS_A
CubeCell-ModulePlus.menu.LORAWAN_CLASS.0.build.LORAWAN_CLASS=CLASS_A
##CubeCell-GPS.menu.LORAWAN_CLASS.1=CLASS_B
##CubeCell-GPS.menu.LORAWAN_CLASS.1.build.LORAWAN_CLASS=CLASS_B
CubeCell-ModulePlus.menu.LORAWAN_CLASS.2=CLASS_C
CubeCell-ModulePlus.menu.LORAWAN_CLASS.2.build.LORAWAN_CLASS=CLASS_C

CubeCell-ModulePlus.menu.LORAWAN_DEVEUI.0=CUSTOM
CubeCell-ModulePlus.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
CubeCell-ModulePlus.menu.LORAWAN_DEVEUI.1=Generate By ChipID
CubeCell-ModulePlus.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

