HelTecAutomation/CubeCell-Arduino/boards.txt
CubeCell-ModulePlus.menu.LORAWAN_NETMODE.0=OTAA
CubeCell-ModulePlus.menu.LORAWAN_NETMODE.0.build.LORAWAN_NETMODE=true
CubeCell-ModulePlus.menu.LORAWAN_NETMODE.1=ABP
CubeCell-ModulePlus.menu.LORAWAN_NETMODE.1.build.LORAWAN_NETMODE=false

CubeCell-ModulePlus.menu.LORAWAN_ADR.0=ON
CubeCell-ModulePlus.menu.LORAWAN_ADR.0.build.LORAWAN_ADR=true
CubeCell-ModulePlus.menu.LORAWAN_ADR.1=OFF
CubeCell-ModulePlus.menu.LORAWAN_ADR.1.build.LORAWAN_ADR=false

CubeCell-ModulePlus.menu.LORAWAN_UPLINKMODE.0=CONFIRMED
CubeCell-ModulePlus.menu.LORAWAN_UPLINKMODE.0.build.LORAWAN_UPLINKMODE=true
CubeCell-ModulePlus.menu.LORAWAN_UPLINKMODE.1=UNCONFIRMED
CubeCell-ModulePlus.menu.LORAWAN_UPLINKMODE.1.build.LORAWAN_UPLINKMODE=false

CubeCell-ModulePlus.menu.LORAWAN_Net_Reserve.0=OFF
CubeCell-ModulePlus.menu.LORAWAN_Net_Reserve.0.build.LORAWAN_Net_Reserve=false
CubeCell-ModulePlus.menu.LORAWAN_Net_Reserve.1=ON
CubeCell-ModulePlus.menu.LORAWAN_Net_Reserve.1.build.LORAWAN_Net_Reserve=true

CubeCell-ModulePlus.menu.LORAWAN_AT_SUPPORT.0=ON
CubeCell-ModulePlus.menu.LORAWAN_AT_SUPPORT.0.build.LORAWAN_AT_SUPPORT=1
CubeCell-ModulePlus.menu.LORAWAN_AT_SUPPORT.1=OFF
CubeCell-ModulePlus.menu.LORAWAN_AT_SUPPORT.1.build.LORAWAN_AT_SUPPORT=0

CubeCell-ModulePlus.menu.LORAWAN_RGB.0=DEACTIVE
CubeCell-ModulePlus.menu.LORAWAN_RGB.0.build.RGB=0

CubeCell-ModulePlus.menu.LORAWAN_DebugLevel.0=None
CubeCell-ModulePlus.menu.LORAWAN_DebugLevel.0.build.LORAWAN_DebugLevel=0
CubeCell-ModulePlus.menu.LORAWAN_DebugLevel.1=Freq
CubeCell-ModulePlus.menu.LORAWAN_DebugLevel.1.build.LORAWAN_DebugLevel=1
CubeCell-ModulePlus.menu.LORAWAN_DebugLevel.2=Freq && DIO
CubeCell-ModulePlus.menu.LORAWAN_DebugLevel.2.build.LORAWAN_DebugLevel=2
###############################
CubeCell-1/2AA.name=CubeCell-1/2AA Node（HTCC-AB02A）

CubeCell-1/2AA.upload.tool=CubeCellflash
CubeCell-1/2AA.upload.maximum_size=131072
CubeCell-1/2AA.upload.maximum_data_size=131072
CubeCell-1/2AA.upload.wait_for_upload_port=true

CubeCell-1/2AA.build.board=CubeCell_HalfAA
CubeCell-1/2AA.build.core=asr650x
CubeCell-1/2AA.build.mcu=ASR6502
CubeCell-1/2AA.build.f_cpu=48000000L
CubeCell-1/2AA.build.variant=CubeCell-HalfAA

CubeCell-1/2AA.menu.LORAWAN_REGION.0=REGION_AS923(AS1)
CubeCell-1/2AA.menu.LORAWAN_REGION.0.build.band=REGION_AS923_AS1
CubeCell-1/2AA.menu.LORAWAN_REGION.1=REGION_AS923(AS2)
CubeCell-1/2AA.menu.LORAWAN_REGION.1.build.band=REGION_AS923_AS2
CubeCell-1/2AA.menu.LORAWAN_REGION.2=REGION_AU915
CubeCell-1/2AA.menu.LORAWAN_REGION.2.build.band=REGION_AU915
CubeCell-1/2AA.menu.LORAWAN_REGION.3=REGION_CN470
CubeCell-1/2AA.menu.LORAWAN_REGION.3.build.band=REGION_CN470
CubeCell-1/2AA.menu.LORAWAN_REGION.4=REGION_CN779
CubeCell-1/2AA.menu.LORAWAN_REGION.4.build.band=REGION_CN779
CubeCell-1/2AA.menu.LORAWAN_REGION.5=REGION_EU433
CubeCell-1/2AA.menu.LORAWAN_REGION.5.build.band=REGION_EU433
CubeCell-1/2AA.menu.LORAWAN_REGION.6=REGION_EU868
CubeCell-1/2AA.menu.LORAWAN_REGION.6.build.band=REGION_EU868
CubeCell-1/2AA.menu.LORAWAN_REGION.7=REGION_KR920
CubeCell-1/2AA.menu.LORAWAN_REGION.7.build.band=REGION_KR920
CubeCell-1/2AA.menu.LORAWAN_REGION.8=REGION_IN865
CubeCell-1/2AA.menu.LORAWAN_REGION.8.build.band=REGION_IN865
CubeCell-1/2AA.menu.LORAWAN_REGION.9=REGION_US915
CubeCell-1/2AA.menu.LORAWAN_REGION.9.build.band=REGION_US915
CubeCell-1/2AA.menu.LORAWAN_REGION.10=REGION_US915_HYBRID
CubeCell-1/2AA.menu.LORAWAN_REGION.10.build.band=REGION_US915_HYBRID

CubeCell-1/2AA.menu.LORAWAN_CLASS.0=CLASS_A
CubeCell-1/2AA.menu.LORAWAN_CLASS.0.build.LORAWAN_CLASS=CLASS_A
##CubeCell-GPS.menu.LORAWAN_CLASS.1=CLASS_B
##CubeCell-GPS.menu.LORAWAN_CLASS.1.build.LORAWAN_CLASS=CLASS_B
CubeCell-1/2AA.menu.LORAWAN_CLASS.2=CLASS_C
CubeCell-1/2AA.menu.LORAWAN_CLASS.2.build.LORAWAN_CLASS=CLASS_C

CubeCell-1/2AA.menu.LORAWAN_DEVEUI.0=CUSTOM
CubeCell-1/2AA.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
CubeCell-1/2AA.menu.LORAWAN_DEVEUI.1=Generate By ChipID
CubeCell-1/2AA.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

CubeCell-1/2AA.menu.LORAWAN_NETMODE.0=OTAA
CubeCell-1/2AA.menu.LORAWAN_NETMODE.0.build.LORAWAN_NETMODE=true
CubeCell-1/2AA.menu.LORAWAN_NETMODE.1=ABP
CubeCell-1/2AA.menu.LORAWAN_NETMODE.1.build.LORAWAN_NETMODE=false

CubeCell-1/2AA.menu.LORAWAN_ADR.0=ON
CubeCell-1/2AA.menu.LORAWAN_ADR.0.build.LORAWAN_ADR=true
CubeCell-1/2AA.menu.LORAWAN_ADR.1=OFF
CubeCell-1/2AA.menu.LORAWAN_ADR.1.build.LORAWAN_ADR=false

CubeCell-1/2AA.menu.LORAWAN_UPLINKMODE.0=CONFIRMED
CubeCell-1/2AA.menu.LORAWAN_UPLINKMODE.0.build.LORAWAN_UPLINKMODE=true
CubeCell-1/2AA.menu.LORAWAN_UPLINKMODE.1=UNCONFIRMED
CubeCell-1/2AA.menu.LORAWAN_UPLINKMODE.1.build.LORAWAN_UPLINKMODE=false

CubeCell-1/2AA.menu.LORAWAN_Net_Reserve.0=OFF
CubeCell-1/2AA.menu.LORAWAN_Net_Reserve.0.build.LORAWAN_Net_Reserve=false
CubeCell-1/2AA.menu.LORAWAN_Net_Reserve.1=ON
CubeCell-1/2AA.menu.LORAWAN_Net_Reserve.1.build.LORAWAN_Net_Reserve=true

CubeCell-1/2AA.menu.LORAWAN_AT_SUPPORT.0=ON
CubeCell-1/2AA.menu.LORAWAN_AT_SUPPORT.0.build.LORAWAN_AT_SUPPORT=1
CubeCell-1/2AA.menu.LORAWAN_AT_SUPPORT.1=OFF
CubeCell-1/2AA.menu.LORAWAN_AT_SUPPORT.1.build.LORAWAN_AT_SUPPORT=0

CubeCell-1/2AA.menu.LORAWAN_RGB.0=DEACTIVE
CubeCell-1/2AA.menu.LORAWAN_RGB.0.build.RGB=0

CubeCell-1/2AA.menu.LORAWAN_DebugLevel.0=None
CubeCell-1/2AA.menu.LORAWAN_DebugLevel.0.build.LORAWAN_DebugLevel=0
CubeCell-1/2AA.menu.LORAWAN_DebugLevel.1=Freq
CubeCell-1/2AA.menu.LORAWAN_DebugLevel.1.build.LORAWAN_DebugLevel=1
CubeCell-1/2AA.menu.LORAWAN_DebugLevel.2=Freq && DIO
CubeCell-1/2AA.menu.LORAWAN_DebugLevel.2.build.LORAWAN_DebugLevel=2

###############################

CubeCell-Board-PRO.name=CubeCell-Board PRO（HTCC-AB03）

CubeCell-Board-PRO.upload.tool=flash6601
CubeCell-Board-PRO.upload.maximum_size=229376
CubeCell-Board-PRO.upload.maximum_data_size=229376
CubeCell-Board-PRO.upload.wait_for_upload_port=true

CubeCell-Board-PRO.build.board=CubeCell_BoardPRO
CubeCell-Board-PRO.build.core=asr6601
CubeCell-Board-PRO.build.mcu=ASR6601
CubeCell-Board-PRO.build.variant=CubeCell-Board-PRO
CubeCell-Board-PRO.build.f_cpu=48000000L

CubeCell-Board-PRO.menu.LORAWAN_REGION.0=REGION_AS923(AS1)
CubeCell-Board-PRO.menu.LORAWAN_REGION.0.build.band=REGION_AS923_AS1
CubeCell-Board-PRO.menu.LORAWAN_REGION.1=REGION_AS923(AS2)
CubeCell-Board-PRO.menu.LORAWAN_REGION.1.build.band=REGION_AS923_AS2
CubeCell-Board-PRO.menu.LORAWAN_REGION.2=REGION_AU915
CubeCell-Board-PRO.menu.LORAWAN_REGION.2.build.band=REGION_AU915
CubeCell-Board-PRO.menu.LORAWAN_REGION.3=REGION_CN470
CubeCell-Board-PRO.menu.LORAWAN_REGION.3.build.band=REGION_CN470
CubeCell-Board-PRO.menu.LORAWAN_REGION.4=REGION_CN779
CubeCell-Board-PRO.menu.LORAWAN_REGION.4.build.band=REGION_CN779
CubeCell-Board-PRO.menu.LORAWAN_REGION.5=REGION_EU433
CubeCell-Board-PRO.menu.LORAWAN_REGION.5.build.band=REGION_EU433
CubeCell-Board-PRO.menu.LORAWAN_REGION.6=REGION_EU868
CubeCell-Board-PRO.menu.LORAWAN_REGION.6.build.band=REGION_EU868
CubeCell-Board-PRO.menu.LORAWAN_REGION.7=REGION_KR920
CubeCell-Board-PRO.menu.LORAWAN_REGION.7.build.band=REGION_KR920
CubeCell-Board-PRO.menu.LORAWAN_REGION.8=REGION_IN865
CubeCell-Board-PRO.menu.LORAWAN_REGION.8.build.band=REGION_IN865
CubeCell-Board-PRO.menu.LORAWAN_REGION.9=REGION_US915
CubeCell-Board-PRO.menu.LORAWAN_REGION.9.build.band=REGION_US915
CubeCell-Board-PRO.menu.LORAWAN_REGION.10=REGION_US915_HYBRID
CubeCell-Board-PRO.menu.LORAWAN_REGION.10.build.band=REGION_US915_HYBRID

CubeCell-Board-PRO.menu.LORAWAN_CLASS.0=CLASS_A
CubeCell-Board-PRO.menu.LORAWAN_CLASS.0.build.LORAWAN_CLASS=CLASS_A
##CubeCell-Board-PRO.menu.LORAWAN_CLASS.1=CLASS_B
##CubeCell-Board-PRO.menu.LORAWAN_CLASS.1.build.LORAWAN_CLASS=CLASS_B
CubeCell-Board-PRO.menu.LORAWAN_CLASS.2=CLASS_C
CubeCell-Board-PRO.menu.LORAWAN_CLASS.2.build.LORAWAN_CLASS=CLASS_C

