HelTecAutomation/CubeCell-Arduino/boards.txt
CubeCell-Board-PRO.menu.LORAWAN_DEVEUI.0=CUSTOM
CubeCell-Board-PRO.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
CubeCell-Board-PRO.menu.LORAWAN_DEVEUI.1=Generate By ChipID
CubeCell-Board-PRO.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

CubeCell-Board-PRO.menu.LORAWAN_NETMODE.0=OTAA
CubeCell-Board-PRO.menu.LORAWAN_NETMODE.0.build.LORAWAN_NETMODE=true
CubeCell-Board-PRO.menu.LORAWAN_NETMODE.1=ABP
CubeCell-Board-PRO.menu.LORAWAN_NETMODE.1.build.LORAWAN_NETMODE=false

CubeCell-Board-PRO.menu.LORAWAN_ADR.0=ON
CubeCell-Board-PRO.menu.LORAWAN_ADR.0.build.LORAWAN_ADR=true
CubeCell-Board-PRO.menu.LORAWAN_ADR.1=OFF
CubeCell-Board-PRO.menu.LORAWAN_ADR.1.build.LORAWAN_ADR=false

CubeCell-Board-PRO.menu.LORAWAN_UPLINKMODE.0=CONFIRMED
CubeCell-Board-PRO.menu.LORAWAN_UPLINKMODE.0.build.LORAWAN_UPLINKMODE=true
CubeCell-Board-PRO.menu.LORAWAN_UPLINKMODE.1=UNCONFIRMED
CubeCell-Board-PRO.menu.LORAWAN_UPLINKMODE.1.build.LORAWAN_UPLINKMODE=false

CubeCell-Board-PRO.menu.LORAWAN_Net_Reserve.0=OFF
CubeCell-Board-PRO.menu.LORAWAN_Net_Reserve.0.build.LORAWAN_Net_Reserve=false
CubeCell-Board-PRO.menu.LORAWAN_Net_Reserve.1=ON
CubeCell-Board-PRO.menu.LORAWAN_Net_Reserve.1.build.LORAWAN_Net_Reserve=true

CubeCell-Board-PRO.menu.LORAWAN_AT_SUPPORT.0=ON
CubeCell-Board-PRO.menu.LORAWAN_AT_SUPPORT.0.build.LORAWAN_AT_SUPPORT=1
CubeCell-Board-PRO.menu.LORAWAN_AT_SUPPORT.1=OFF
CubeCell-Board-PRO.menu.LORAWAN_AT_SUPPORT.1.build.LORAWAN_AT_SUPPORT=0

CubeCell-Board-PRO.menu.LORAWAN_RGB.1=ACTIVE
CubeCell-Board-PRO.menu.LORAWAN_RGB.1.build.RGB=1
CubeCell-Board-PRO.menu.LORAWAN_RGB.0=DEACTIVE
CubeCell-Board-PRO.menu.LORAWAN_RGB.0.build.RGB=0

CubeCell-Board-PRO.menu.LORAWAN_DebugLevel.0=None
CubeCell-Board-PRO.menu.LORAWAN_DebugLevel.0.build.LORAWAN_DebugLevel=0
CubeCell-Board-PRO.menu.LORAWAN_DebugLevel.1=Freq
CubeCell-Board-PRO.menu.LORAWAN_DebugLevel.1.build.LORAWAN_DebugLevel=1
CubeCell-Board-PRO.menu.LORAWAN_DebugLevel.2=Freq && DIO
CubeCell-Board-PRO.menu.LORAWAN_DebugLevel.2.build.LORAWAN_DebugLevel=2